clear;clc;
H=1;N=1;   %水平力和轴力大小，单位均为KN

%上塔柱
h=1400;         %单位：mm
h0=h-55-28;

b=900;          %单位：mm

ys=h/2-55-28;
As=5542*2;

%下塔柱
%h=1600;         %单位：mm
%h0=1600-55-28;
%b=1300;         %单位：mm
%ys=h/2-55-28;
%As=8005*2;


%单位换算成m
h0=h0/1000;     
b=b/1000;
ys=ys/1000;

l_=11.513;      %上塔柱高度：11.513
l=4.827;        %下塔柱高度：4.827
%上下塔柱长度（高度），单位：米
l0=2*l;         %构件计算长度

e0=H*l_;        %偏心距

%计算使用阶段的轴向压力偏心距增大系数
if l0/h<=14
    ita_s=1.0;
else
    ita_s=1+(l*(4000*e0*h0^-1))*(l0/h)^2;   
end

gamma_f_=0; %γf'=0

%轴向压力作用点至纵向受拉钢筋合力点的距离
es=ita_s*e0+ys;

%纵向受拉钢筋合力点至截面受压区合力点的距离
z=(0.87-0.12*(1-gamma_f)*(h0/es)^2)*h0;

%纵向受拉钢筋的应力
sigma_ss=N*(es-z)/(As*z);

c1=1.0; %钢筋表面形状系数
c2=1.0; %作用长期效应影响系数
c3=0.9; %与构件受力性质有关的系数
d=28;   %纵向受拉钢筋的直径
Es=2.00*10^5;   %普通钢筋弹性模量
rou=As*(b*h0)^-1;   %配筋率
%最大裂缝宽度
Wfk=c1*c2*c3*sigma_ss*Es^-1*(30+d)*(0.28+10*rou)^-1

